tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "supabase/tap"
tap "surrealdb/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Collection of portable C++ source libraries
brew "boost"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Generic library support script
brew "libtool"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Command-line tool to interact with exercism.io
brew "exercism"
# Easiest way to build and release mobile apps
brew "fastlane"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Thrift functions for querying information from a service
brew "fb303"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# GNU compiler collection
brew "gcc"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Official GitLab CI runner
brew "gitlab-runner"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Watch files and take action when they change
brew "watchman"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Supabase CLI
brew "supabase/tap/supabase"
# A scalable, distributed, collaborative, document-graph database
brew "surrealdb/tap/surreal"
# Open-source project and knowledge management tool
cask "appflowy"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# HTTP and GraphQL Client
cask "insomnia"
# LLVM backend for Kotlin
cask "kotlin-native"
# Control your tools with a few keystrokes
cask "raycast"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Backup and synchronise preferences across multiple machines
cask "syncalicious"
# OpenJDK distribution from Azul
cask "zulu11"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "anoff.theme-monokai-light"
vscode "apvarun.celestial"
vscode "blaugold.melos-code"
vscode "codeium.codeium"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gruntfuggly.todo-tree"
vscode "illixion.vscode-vibrancy-continued"
vscode "jeroen-meijer.pubspec-assist"
vscode "kahole.magit"
vscode "lehni.vscode-fix-checksums"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "mjmcloug.vscode-elixir"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mquandalle.graphql"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "nash.awesome-flutter-snippets"
vscode "oderwat.indent-rainbow"
vscode "parthr2031.colorful-comments"
vscode "paulshen.paul-typescript-toolkit"
vscode "pkief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "saratravi.elixir-formatter"
vscode "sdras.night-owl"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tobias-z.vscode-harpoon"
vscode "twxs.cmake"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
